//Task1
#include <iostream>
using namespace std;

int main()
{

    cout << "Ой у лузі червона калина похилилася,\n"
        "Чогось наша славна Україна засмутилася.\n"
        "А ми тую червону калину піднімемо,\n"
        "А ми нашу славну Україну, гей-гей, розвеселимо!\n"
        "Виконавець: Українська народна\n\n";
}

//________________________________________________________
//Task2

#include <iostream>
using namespace std;

int main() {
    cout << "Every\n"
        "\tHunter\n"
        "\t\tWants\n"
        "\t\t\tTo\n"
        "\t\t\t\tKnow\n"
        "\t\t\t\t\tWhere\n"
        "\t\t\t\t\t\tDoes\n"
        "\t\t\t\t\t\t\tPheasant\n"
        "\t\t\t\t\t\t\t\tSit\n";

}

//________________________________________________________
//Task3

#include <iostream>
using namespace std;

int main() 
{
    cout << "Продам автомобіль.\n"
        "Модель: McLaren p1.\n"
        "Рік: 2024\n"
        "Колір: червоний\n"
        "Двигун: гібридний V6, 680 к.с.\n"
        "Тип палива: бензин + електро\n"
        "Коробка передач: 8-ступенева автоматична\n"
        "Пробіг: 5000 км\n\n"
        "Телефон для контакту: 098-765-43-21\n";

}